ecdr/elua/src/platform/lm3s/platform.c
#if CAN_PORT==B
#define CAN_PORT_BASE	GPIO_PORTB_BASE
#define CAN_PORT_PINS	( GPIO_PIN_4 | GPIO_PIN_5 )

#define PIN_CAN0RX	GPIO_PB4_CAN0RX
#define PIN_CAN0TX	GPIO_PB5_CAN0TX

#elif CAN_PORT==E

#define CAN_PORT_BASE	GPIO_PORTE_BASE
#define CAN_PORT_PINS	( GPIO_PIN_4 | GPIO_PIN_5 )

#define PIN_CAN0RX	GPIO_PE4_CAN0RX
#define PIN_CAN0TX	GPIO_PE5_CAN0TX

#elif CAN_PORT==F

// Note that F0 is connected to pushbutton, and F3 is connected to RGB LED (so would have to modify LP to use)

#if PIO_UNLOCK_NMI
#warning CAN using portF, but PF0 and PF3 connected to peripherals on launchpad.
#else
#error Need to define PIO_UNLOCK_NMI, or fix code to allow reprogramming of pin PF_0
#endif


#define CAN_PORT_BASE	GPIO_PORTF_BASE
#define CAN_PORT_PINS	( GPIO_PIN_0 | GPIO_PIN_3 )

#define PIN_CAN0RX	GPIO_PF0_CAN0RX
#define PIN_CAN0TX	GPIO_PF3_CAN0TX

#else
#error Unrecognized CAN port: CAN_PORT
#endif // CAN_PORT

#if defined ( FORLM4F230 )	// LM4F230 only

// CAN1_BASE already defined in hw_memmap.h
//#define CAN1_BASE		GPIO_PORTA_BASE
//#define CAN1_PINS		( GPIO_PIN_0 | GPIO_PIN_1 )

#endif


#else

#define CAN_PORT_BASE	GPIO_PORTD_BASE
#define CAN_PORT_PINS	( GPIO_PIN_0 | GPIO_PIN_1 )

#if defined( FORLM3S8962 )
// Figure out what these should be on 3s8962 - not sure why below not defined
#define PIN_CAN0RX	CAN0RX_PIN
#define PIN_CAN0TX	CAN0TX_PIN
#warning Do not use CAN - pins not set up right
#else
// Check this - does it work on 8962?  (Not sure that GPIO_PD0_CAN0RX, TX are defined on that platform)
// FixMe: Doesn't work on 8962
#define PIN_CAN0RX	GPIO_PD0_CAN0RX
#define PIN_CAN0TX	GPIO_PD1_CAN0TX
#endif

#endif

/* Code assumes that RX and TX pins will be on same port.  
Stellarisware defines the following for some CPUs (e.g. 8962)
#define CAN0RX_PERIPH           SYSCTL_PERIPH_GPIOD
#define CAN0RX_PORT             GPIO_PORTD_BASE
#define CAN0RX_PIN              GPIO_PIN_0

#define CAN0TX_PERIPH           SYSCTL_PERIPH_GPIOD
#define CAN0TX_PORT             GPIO_PORTD_BASE
#define CAN0TX_PIN              GPIO_PIN_1
*/


// TODO: generalize to multiple CANs 

#if (NUM_CAN > 1)
#define CAN1B , CAN1_BASE
#define CAN1SYS , SYSCTL_PERIPH_CAN1
#define CAN1INT , INT_CAN1
#define CAN1GPB , CAN1_BASE
#define CAN1P   , CAN1_PINS
#else
#define CAN1B
#define CAN1SYS
#define CAN1INT
#define CAN1GPB
#define CAN1P
#endif

static const u32 can_base[] =   { CAN0_BASE           CAN1B };
static const u32 can_sysctl[] = { SYSCTL_PERIPH_CAN0  CAN1SYS };
static const u32 can_int[] =    { INT_CAN0            CAN1INT };

static const u32 can_gpio_base[] =  { CAN_PORT_BASE   CAN1GPB };
static const u8 can_gpio_pins[] =   { CAN_PORT_PINS   CAN1P };

// FIXME: Flags could be BOOL or bit
typedef struct {
  volatile u8 rx_flag, tx_flag, err_flag; 
  char tx_buf[PLATFORM_CAN_MAXLEN]; 
  tCANMsgObject msg_rx;
} can_status_t;

// FIXME: Need to initialize flags
can_status_t can_status[ NUM_CAN-1 ];

//volatile u8 can_rx_flag = 0;
//volatile u8 can_tx_flag = 0;
//volatile u8 can_err_flag = 0;
//char can_tx_buf[PLATFORM_CAN_MAXLEN];
//tCANMsgObject can_msg_rx;

// LM3S9Bxx and LM4F120 MCU CAN seems to run off of system clock, LM3S8962 has 8 MHz clock

#if defined( FORLM3S8962 )
#define LM3S_CAN_CLOCK  8000000
#else
#define LM3S_CAN_CLOCK  SysCtlClockGet()
#endif

void CANIntHandler(unsigned id);

void can0_handler(void)
{
	CANIntHandler(0);
}

void can1_handler(void)
{
	CANIntHandler(1);
}

void can2_handler(void)
{
	CANIntHandler(2);
}


void CANIntHandler(unsigned id)
{
// Fixme: Needs to handle multiple CANs (flags)

  u32 status = MAP_CANIntStatus(can_base[id], CAN_INT_STS_CAUSE);

// ToDO: Why not use a switch statement?
  if(status == CAN_INT_INTID_STATUS)
  {
    status = MAP_CANStatusGet(can_base[id], CAN_STS_CONTROL);

// Why is the status fetched but not used?
    can_status[id].err_flag = 1;
    can_status[id].tx_flag = 0;
  }
  else if( status == 1 ) // Message receive
  {
    MAP_CANIntClear(can_base[id], 1);
    can_status[id].rx_flag = 1;
    can_status[id].err_flag = 0;
  }
  else if( status == 2 ) // Message send
  {
    MAP_CANIntClear(can_base[id], 2);
    can_status[id].tx_flag = 0;
    can_status[id].err_flag = 0;
  }
  else
    MAP_CANIntClear(can_base[id], status);
}


void cans_init( void )
{
  unsigned id;

  for( id = 0; id < NUM_CAN; id++){
    MAP_SysCtlPeripheralEnable( can_sysctl[id] );
    MAP_CANInit( can_base[id] );
    MAP_CANBitRateSet(can_base[id], LM3S_CAN_CLOCK, 500000);
    MAP_CANIntEnable(can_base[id], CAN_INT_MASTER | CAN_INT_ERROR | CAN_INT_STATUS );
    MAP_IntEnable(can_int[id]);
    MAP_CANEnable(can_base[id]);

      // Configure default catch-all message object
    can_status[id].msg_rx.ulMsgID = 0;
    can_status[id].msg_rx.ulMsgIDMask = 0;
    can_status[id].msg_rx.ulFlags = MSG_OBJ_RX_INT_ENABLE | MSG_OBJ_USE_ID_FILTER;
      can_status[id].msg_rx.ulMsgLen = PLATFORM_CAN_MAXLEN;
    MAP_CANMessageSet(can_base[id], 1, &can_status[id].msg_rx, MSG_OBJ_TYPE_RX);
  }
}

u32 platform_can_setup( unsigned id, u32 clock )
{
  //TODO: generalize to more than 2 CANs
  if (id == 0) 
  {
    MAP_GPIOPinConfigure(PIN_CAN0RX);
    MAP_GPIOPinConfigure(PIN_CAN0TX);
  } else {
#if (NUM_CAN > 1)  
    MAP_GPIOPinConfigure(PIN_CAN1RX);
    MAP_GPIOPinConfigure(PIN_CAN1TX);
#endif    
  }
  MAP_GPIOPinTypeCAN(can_gpio_base[id], can_gpio_pins[id]);

  MAP_CANDisable(can_base[id]);
  MAP_CANBitRateSet(can_base[id], LM3S_CAN_CLOCK, clock );
  MAP_CANEnable(can_base[id]);
  return clock;
}

void platform_can_send( unsigned id, u32 canid, u8 idtype, u8 len, const u8 *data )
{
  tCANMsgObject msg_tx;
  const char *s = ( char * )data;
  char *d;

  // Wait for outgoing messages to clear
  while( can_status[id].tx_flag == 1 );

  msg_tx.ulFlags = MSG_OBJ_TX_INT_ENABLE;
  
  if( idtype == ELUA_CAN_ID_EXT )
    msg_tx.ulFlags |= MSG_OBJ_EXTENDED_ID;
  
  msg_tx.ulMsgIDMask = 0;
  msg_tx.ulMsgID = canid;
  msg_tx.ulMsgLen = len;
  msg_tx.pucMsgData = ( u8 * )can_status[id].tx_buf;

  d = can_status[id].tx_buf;
  DUFF_DEVICE_8( len,  *d++ = *s++ );

  can_status[id].tx_flag = 1;
  MAP_CANMessageSet(can_base[id], 2, &msg_tx, MSG_OBJ_TYPE_TX);
}

int platform_can_recv( unsigned id, u32 *canid, u8 *idtype, u8 *len, u8 *data )
{
  // wait for a message
  if( can_status[id].rx_flag != 0 )
  {
    can_status[id].msg_rx.pucMsgData = data;
    MAP_CANMessageGet(can_base[id], 1, &can_status[id].msg_rx, 0);
    can_status[id].rx_flag = 0;

    *canid = ( u32 )can_status[id].msg_rx.ulMsgID;
    *idtype = ( can_status[id].msg_rx.ulFlags & MSG_OBJ_EXTENDED_ID )? ELUA_CAN_ID_EXT : ELUA_CAN_ID_STD;
    *len = can_status[id].msg_rx.ulMsgLen;
    return PLATFORM_OK;
  }
  else
    return PLATFORM_UNDERFLOW;
}

#endif


// ****************************************************************************
// SPI

