ecdr/elua/src/platform/lm3s/platform.c
const u32 i2c_base[] = { I2C0_MASTER_BASE, I2C1_MASTER_BASE, I2C2_MASTER_BASE, I2C3_MASTER_BASE };
static const u32 i2c_sysctl[] = { SYSCTL_PERIPH_I2C0, SYSCTL_PERIPH_I2C1, SYSCTL_PERIPH_I2C2, SYSCTL_PERIPH_I2C3 };
static const u32 i2c_gpio_base[] = { GPIO_PORTB_BASE, GPIO_PORTA_BASE, GPIO_PORTE_BASE, GPIO_PORTD_BASE };
static const u8 i2c_gpio_pins[] = { GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_6 | GPIO_PIN_7, GPIO_PIN_4 | GPIO_PIN_5, GPIO_PIN_0 | GPIO_PIN_1 };

static const i2c_scl_pin[] = { GPIO_PB2_I2C0SCL, GPIO_PA6_I2C1SCL, GPIO_PE4_I2C2SCL, GPIO_PD0_I2C3SCL };
static const i2c_sda_pin[] = { GPIO_PB3_I2C0SDA, GPIO_PA7_I2C1SDA, GPIO_PE5_I2C2SDA, GPIO_PD1_I2C3SDA };


#elif defined( FORLM6918 ) || defined( FORLM6965 ) || defined( FORLM3S9B92 ) || defined( FORLM3S9D92 )
//FIXME: Fill in base, pins, etc - have 2 I2C (though may not all use same ports)

#elif defined( FORLM8962 )
//FIXME: Fill in base, pins, etc. (1 I2C)


const u32 i2c_base[] = { I2C_MASTER_BASE };
static const u32 i2c_sysctl[] = { SYSCTL_PERIPH_I2C0 };
//FIXME: needs pin mux data (or suppress that behavior)
static const u32 i2c_gpio_base[] = {};
static const u8 i2c_gpio_pins[] = {};

static const i2c_scl_pin[] = {};
static const i2c_sda_pin[] = {};
#endif


// FIXME: just copied from others, need to check documents
static void I2Cs_init()
{
  unsigned i;
  for( i = 0; i < NUM_I2C; i ++ )
    MAP_SysCtlPeripheralEnable(i2c_sysctl[ i ]);
}


// Platform specific
// Not finished - needs to enable I2C, needs to figure out speed, clock should be from cache
u32 platform_i2c_setup( unsigned id, u32 speed )
{
  //FIXME: Pin mux - may not need for all parts

#ifdef USE_PIN_MUX
  GPIOPinConfigure(i2c_scl_pin[ id ]);
  GPIOPinConfigure(i2c_sda_pin[ id ]);
#endif

  MAP_GPIOPinTypeI2C( i2c_gpio_base [ id ], i2c_gpio_pins[ id ] );

  MAP_I2CMasterInitExpClk( i2c_base[id], MAP_SysCtlClockGet(),  
                    speed == PLATFORM_I2C_SPEED_SLOW);
  //FIXME: Needs to return speed actually set
};


// Address is 0..127, direction - from enum, return is boolean
int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
	BOOL bReceive = (direction == PLATFORM_I2C_DIRECTION_RECEIVER);

  MAP_I2CMasterSlaveAddrSet( i2c_base[id], address, receive	);

  if (bReceive) I2CMasterControl(i2c_base[id], I2C_MASTER_CMD_SINGLE_RECEIVE);
  // Dummy receive so don't get junk on first read

  // FIXME: Not finished - needs to return boolean
}; // Returns boolean  - need to figure out semantics for return "1 for success, 0 for error."

// FIXME: Arbitrarily defined - just number of loops, should be based on time
#define I2C_MAX_WAIT	100000

//TODO: Current code waits until done, not sure if that is desired semantics
int platform_i2c_send_byte( unsigned id, u8 data )
{
  u32 i;
  tBoolean busy;

  //FIXME: Timeout should probably be based on time, not just loop cycles
  for(i=0; i<I2C_MAX_WAIT && busy = MAP_I2CMasterBusBusy( i2c_base[id] ); i++) {}; // Wait until bus free
  if(busy)
	  return 0;	// Still busy - return error
  MAP_I2CMasterDataPut( i2c_base[id], data);
  MAP_I2CMasterControl( i2c_base[id], I2C_MASTER_CMD_SINGLE_SEND);

  //FIXME: Timeout should probably be based on time, not just loop cycles
  for(i=0; i<I2C_MAX_WAIT && MAP_I2CMasterBusBusy( i2c_base[id] ); i++) {};		// Wait until sent

  // Return 0 for problem, 1 for success
  return (MAP_I2CMasterError( i2c_base[id] ) == I2C_MASTER_ERR_NONE) ? 1 : 0;
};

//FIXME: what should this do? "Send an I2C START condition on the specified interface."
void platform_i2c_send_start( unsigned id )
{
};

//FIXME: Just a guess at what this might do  "Send an I2C STOP condition on the specified interface."
void platform_i2c_send_stop( unsigned id )
{
	MAP_I2CMasterControl( i2c_base[id], I2C_MASTER_CMD_BURST_SEND_FINISH );
};


// return byte read, or -1, ack is true except for last item read
// (ack is acknowledge bit to send 1 to acknowledge, 0 to reject/stop)

int platform_i2c_recv_byte( unsigned id, int ack )
{
    I2CMasterControl( i2c_base[id], I2C_MASTER_CMD_SINGLE_RECEIVE);

	return MAP_I2CMasterDataGet( i2c_base[id] );
	// FIXME: this doesn't check for errors, doesn't use ack
};



/*
From AVR:

int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
  // Convert enum codes to R/w bit value.
  // If TX == 0 and RX == 1, this test will be removed by the compiler
  if ( ! ( PLATFORM_I2C_DIRECTION_TRANSMITTER == 0 &&
           PLATFORM_I2C_DIRECTION_RECEIVER == 1 ) ) {
    direction = ( direction == PLATFORM_I2C_DIRECTION_TRANSMITTER ) ? 0 : 1;
  }

  // Low-level returns nack (0=acked); we return ack (1=acked).
  return ! i2c_write_byte( (address << 1) | direction );
}

*/

#endif	// BUILD_I2C


// ****************************************************************************
// UART
// Different configurations for LM3S8962, LM3S6918 (2 UARTs) and LM3S6965, LM3S9B92 (3 UARTs)

// FIXME FORLM4F120 has 8 UART - need way to specify how many want to use
// If implement USB, then remove UART6 - since it uses PD4,5 (so put UART6 last)

#ifdef FORLM4F

const u32 uart_base[] = { 	UART0_BASE, UART1_BASE, UART2_BASE, UART3_BASE, 
      				UART4_BASE, UART5_BASE, UART7_BASE, UART6_BASE };
static const u32 uart_sysctl[] = { 
	SYSCTL_PERIPH_UART0, SYSCTL_PERIPH_UART1, SYSCTL_PERIPH_UART2, SYSCTL_PERIPH_UART3, 
	SYSCTL_PERIPH_UART4, SYSCTL_PERIPH_UART5, SYSCTL_PERIPH_UART7, SYSCTL_PERIPH_UART6 };

static const u32 uart_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTB_BASE, GPIO_PORTD_BASE, 
      GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTD_BASE };
static const u8 uart_gpio_pins[] = { GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_0 | GPIO_PIN_1, 
	GPIO_PIN_6 | GPIO_PIN_7, GPIO_PIN_6 | GPIO_PIN_7, 
	GPIO_PIN_4 | GPIO_PIN_5, GPIO_PIN_4 | GPIO_PIN_5, 
	GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_4 | GPIO_PIN_5 };

// Not really sure what this does, or if filled it in right
// Looks like this is really 2 fields per UUART (should be in a struct) with GPIO_PORTs and PINs
static const u32 uart_gpiofunc[] = {
	GPIO_PA0_U0RX, GPIO_PA1_U0TX, GPIO_PB0_U1RX, GPIO_PB1_U1TX,
	GPIO_PD6_U2RX, GPIO_PD7_U2TX, GPIO_PC6_U3RX, GPIO_PC7_U3TX, 
	GPIO_PC4_U4RX, GPIO_PC5_U4TX, GPIO_PE4_U5RX, GPIO_PE5_U5TX,
	GPIO_PE0_U7RX, GPIO_PE1_U7TX, GPIO_PD4_U6RX, GPIO_PD5_U6TX };

#else // LM3S

// All possible LM3S uart defs
const u32 uart_base[] = { UART0_BASE, UART1_BASE, UART2_BASE };
static const u32 uart_sysctl[] = { SYSCTL_PERIPH_UART0, SYSCTL_PERIPH_UART1, SYSCTL_PERIPH_UART2 };
static const u32 uart_gpio_base[] = { GPIO_PORTA_BASE, GPIO_PORTD_BASE, GPIO_PORTG_BASE };
static const u8 uart_gpio_pins[] = { GPIO_PIN_0 | GPIO_PIN_1, GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_0 | GPIO_PIN_1 };

