ecdr/elua/src/platform/lm3s/platform.c
// SYSCTL div data and actual div factors
const static u32 pwm_div_ctl[] = { SYSCTL_PWMDIV_1, SYSCTL_PWMDIV_2, SYSCTL_PWMDIV_4, SYSCTL_PWMDIV_8, 
	SYSCTL_PWMDIV_16, SYSCTL_PWMDIV_32, SYSCTL_PWMDIV_64 };

const static u8 pwm_div_data[] = { 1, 2, 4, 8, 16, 32, 64 };
#endif // EMULATE_PWM



// Port/pin information for all channels
#if defined(FORLM3S1968)

  const static u32 pwm_ports[] =  { GPIO_PORTG_BASE, GPIO_PORTD_BASE, GPIO_PORTH_BASE, 
						GPIO_PORTH_BASE, GPIO_PORTF_BASE, GPIO_PORTF_BASE };
  const static u8 pwm_pins[] = { GPIO_PIN_2, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3 };

#elif defined(FORLM3S6965)

  const static u32 pwm_ports[] =  { GPIO_PORTF_BASE, GPIO_PORTD_BASE, GPIO_PORTB_BASE, 
						GPIO_PORTB_BASE, GPIO_PORTE_BASE, GPIO_PORTE_BASE };
  const static u8 pwm_pins[] = { GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1 };

#elif defined( ELUA_BOARD_SOLDERCORE ) && defined( FORLM3S9D92 )

  const static u32 pwm_ports[] =  { GPIO_PORTG_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, 
						GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE };
  const static u8 pwm_pins[] = { 	GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3, 
						GPIO_PIN_6, GPIO_PIN_7,  GPIO_PIN_4,  GPIO_PIN_6 };
  const static u32 pwm_configs[] = { GPIO_PG0_PWM0, GPIO_PD1_PWM1, GPIO_PD2_PWM2, GPIO_PD3_PWM3, 
						GPIO_PE6_PWM4, GPIO_PE7_PWM5, GPIO_PC4_PWM6, GPIO_PC6_PWM7 };

#elif defined( FORLM3S9B92 ) || ( defined(FORLM3S9D92) && !defined( ELUA_BOARD_SOLDERCORE ) )

  const static u32 pwm_ports[] =  { GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE, 
						GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE };
  const static u8 pwm_pins[] = { 	GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3, 
						GPIO_PIN_6, GPIO_PIN_7,  GPIO_PIN_4,  GPIO_PIN_6 };
  const static u32 pwm_configs[] = { GPIO_PD0_PWM0, GPIO_PD1_PWM1, GPIO_PD2_PWM2, GPIO_PD3_PWM3, 
						GPIO_PE6_PWM4, GPIO_PE7_PWM5, GPIO_PC4_PWM6, GPIO_PC6_PWM7 };

#elif defined( FORLM4F120 ) 
// FIXME FORLM4F120 has no PWM, simulate PWM using timers
// TODO: At the moment just using wide timers, could look at possible using arbitrary timers (based on which pin want PWMd)

  const static u32 pwm_ports[] = {  GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTD_BASE,
						GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTD_BASE};
  const static u8 pwm_pins[] = {    GPIO_PIN_4, GPIO_PIN_6, GPIO_PIN_0, 
						GPIO_PIN_2, GPIO_PIN_4,  GPIO_PIN_6 };

  const static u32 pwm_configs[] = { GPIO_PC4_WT0CCP0, GPIO_PC6_WT1CCP0, GPIO_PD0_WT2CCP0, 
						GPIO_PD2_WT3CCP0, GPIO_PD4_WT4CCP0, GPIO_PD6_WT5CCP0};

#elif defined( FORLM4F230 ) 

// FIXME: 230 has PWMs, need to fill in data

// TODO: Way to chose alternative pins for PWMS (C6 vs D0, C7 vs D1, A6 vs E4, A7 vs E5)

// M0, 8 PWMS PORTB:4-7, E:4-5, C:4-5 [or] D:0-1, fault on D:2 or D:6 or F:2
// M1, 8 PWMS PORTD:0-1, A:6-7 [or] E:4-5, F:0-3, fault on F:4

  const static u32 pwm_ports[] = {  GPIO_PORTB_BASE, GPIO_PORTB_BASE, GPIO_PORTB_BASE, GPIO_PORTB_BASE, 
						GPIO_PORTE_BASE, GPIO_PORTE_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE, 
						GPIO_PORTD_BASE, GPIO_PORTD_BASE, GPIO_PORTA_BASE, GPIO_PORTA_BASE,
						GPIO_PORTF_BASE, GPIO_PORTF_BASE, GPIO_PORTF_BASE, GPIO_PORTF_BASE  };
  const static u8 pwm_pins[] = {    GPIO_PIN_6, GPIO_PIN_7, GPIO_PIN_4, GPIO_PIN_5,
						GPIO_PIN_4, GPIO_PIN_5, GPIO_PIN_4, GPIO_PIN_5,
						GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_6, GPIO_PIN_7,
						GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3 };

//  const static u32 pwm_configs[] = { };

#elif defined( FORLM3S6918 )
  const static u32 pwm_ports[] = {};
  const static u8 pwm_pins[] = {};

#else


  const static u32 pwm_ports[] =  { GPIO_PORTF_BASE, GPIO_PORTG_BASE, GPIO_PORTB_BASE, 
						GPIO_PORTB_BASE, GPIO_PORTE_BASE, GPIO_PORTE_BASE };
  const static u8 pwm_pins[] = { GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_0, GPIO_PIN_1 };

#endif

// PWM generators
#if defined ( EMULATE_PWM )

static BOOL pwm_enabled[NUM_PWM] = { FALSE };

#if defined( FORLM4F120 ) 
const static u32 pwm_timer_base[] = { WTIMER0_BASE, WTIMER1_BASE, WTIMER2_BASE,
					WTIMER3_BASE, WTIMER4_BASE, WTIMER5_BASE };
// FIXME: Remove wide timers from timer area if using them for PWMs

const static u32 pwm_timer_sysctl[] = { 
	SYSCTL_PERIPH_WTIMER0, SYSCTL_PERIPH_WTIMER1, SYSCTL_PERIPH_WTIMER2,
	SYSCTL_PERIPH_WTIMER3, SYSCTL_PERIPH_WTIMER4, SYSCTL_PERIPH_WTIMER5 };
#endif

#endif //EMULATE_PWM

#if defined( FORLM3S9B92 ) || defined(FORLM3S9D92)
  const static u16 pwm_gens[] = { PWM_GEN_0, PWM_GEN_1, PWM_GEN_2, PWM_GEN_3 };

#elif defined( FORLM4F230 )
  const static u16 pwm_gens[] = { PWM_GEN_0, PWM_GEN_1 };

#else 
  const static u16 pwm_gens[] = { PWM_GEN_0, PWM_GEN_1, PWM_GEN_2 };
#endif

// PWM outputs
#if defined( FORLM3S9B92 ) || defined(FORLM3S9D92)
const static u16 pwm_outs[] = { PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, 
					PWM_OUT_4, PWM_OUT_5, PWM_OUT_6, PWM_OUT_7};
#else
const static u16 pwm_outs[] = { PWM_OUT_0, PWM_OUT_1, PWM_OUT_2, PWM_OUT_3, PWM_OUT_4, PWM_OUT_5 };
#endif

// TODO: What do these do on a system with no PWMs?
static void pwms_init()
{
#if defined( EMULATE_PWM )
//TODO: Write me!!
//  for(id = 0; id < NUM_PWM; id++)
//	pwm_enabled[id] = FALSE;

#else
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_PWM );
  MAP_SysCtlPWMClockSet( SYSCTL_PWMDIV_1 );
#endif // EMULATE_PWM
}

// Return the PWM clock
u32 platform_pwm_get_clock( unsigned id )
{
#ifdef EMULATE_PWM
  return MAP_SysCtlClockGet();

#else
  unsigned i;
  u32 clk;

  clk = MAP_SysCtlPWMClockGet();
  for( i = 0; i < sizeof( pwm_div_ctl ) / sizeof( u32 ); i ++ )
    if( clk == pwm_div_ctl[ i ] )
      break;
  return MAP_SysCtlClockGet() / pwm_div_data[ i ];
#endif // EMULATE_PWM
}

// Set the PWM clock
u32 platform_pwm_set_clock( unsigned id, u32 clock )
{
#ifdef EMULATE_PWM
  return MAP_SysCtlClockGet();

#else
  unsigned i, min_i;
  u32 sysclk;

  sysclk = MAP_SysCtlClockGet();
  for( i = min_i = 0; i < sizeof( pwm_div_data ) / sizeof( u8 ); i ++ )
    if( ABSDIFF( clock, sysclk / pwm_div_data[ i ] ) < ABSDIFF( clock, sysclk / pwm_div_data[ min_i ] ) )
      min_i = i;
  MAP_SysCtlPWMClockSet( pwm_div_ctl[ min_i ] );
  return sysclk / pwm_div_data[ min_i ];
#endif // EMULATE_PWM
}


//duty - PWM channel duty cycle, specified as integer from 0 to 100 (percent).
u32 platform_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
  u32 pwmclk = platform_pwm_get_clock( id );
  u32 period;

#if defined( FORLM3S9B92 ) || defined( FORLM3S9D92 ) || defined( FORLM4F120 )
  GPIOPinConfigure( pwm_configs[ id ] );
#endif

#ifdef EMULATE_PWM

// Assumes that GPIO for pins (sysctrl) have already been enabled by PIO module

//TODO: Be sure timer disabled before making changes
//  if allow timer to be used as PWM or timer, then need to keep track of use
//TODO: Maybe belong in general init 
  if (!pwm_enabled[id]){	// Initialize timer if not already set up
	MAP_GPIOPinTypeTimer(pwm_ports[id], pwm_pins[id]); 
	MAP_SysCtlPeripheralEnable(pwm_timer_base[id]);	
	MAP_TimerConfigure(pwm_timer_base[id], TIMER_CFG_SPLIT_PAIR|TIMER_CFG_A_PWM);
	pwm_enabled[id] = TRUE;
  }

