ecdr/elua/src/platform/lm3s/platform.c
u32 platform_adc_set_clock( unsigned id, u32 frequency )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  // Make sure sequencer is disabled before making changes
  MAP_ADCSequenceDisable( ADC_BASE, d->seq_id );
  
  if ( frequency > 0 )
  {
    d->clocked = 1;
    // Set sequence id to be triggered repeatedly, with priority id
    MAP_ADCSequenceConfigure( ADC_BASE, d->seq_id, ADC_TRIGGER_TIMER, d->seq_id );

    // Set up timer trigger
    MAP_TimerLoadSet( timer_base[ d->timer_id ], TIMER_A, MAP_SysCtlClockGet() / frequency );
    frequency = MAP_SysCtlClockGet() / MAP_TimerLoadGet( timer_base[ d->timer_id ], TIMER_A );
  }
  else
  {
    d->clocked = 0;
    // Conversion will run back-to-back until required samples are acquired
    MAP_ADCSequenceConfigure( ADC_BASE, d->seq_id, ADC_TRIGGER_PROCESSOR, d->seq_id ) ;
  }
    
  return frequency;
}


int platform_adc_update_sequence( )
{  
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  MAP_ADCSequenceDisable( ADC_BASE, d->seq_id );
  
  // NOTE: seq ctr should have an incrementer that will wrap appropriately..
  d->seq_ctr = 0; 
  while( d->seq_ctr < d->seq_len-1 )
  {
    MAP_ADCSequenceStepConfigure( ADC_BASE, d->seq_id, d->seq_ctr, adc_ctls[ d->ch_state[ d->seq_ctr ]->id ] );
#ifdef ADC_PIN_CONFIG
    if (adc_ctls[ d->ch_state[ d->seq_ctr ]->id ] != ADC_CTL_TS)	// Temperature sensor channel does not have pin
        MAP_GPIOPinTypeADC( adc_ports[ d->ch_state[ d->seq_ctr ]->id ], adc_pins[ d->ch_state[ d->seq_ctr ]->id ] );
#endif
    d->seq_ctr++;
  }
  MAP_ADCSequenceStepConfigure( ADC_BASE, d->seq_id, d->seq_ctr, ADC_CTL_IE | ADC_CTL_END | adc_ctls[ d->ch_state[ d->seq_ctr ]->id ] );
#ifdef ADC_PIN_CONFIG
  if (adc_ctls[ d->ch_state[ d->seq_ctr ]->id ] != ADC_CTL_TS)	// Temperature sensor channel does not have pin
    MAP_GPIOPinTypeADC( adc_ports[ d->ch_state[ d->seq_ctr ]->id ], adc_pins[ d->ch_state[ d->seq_ctr ]->id ] );
#endif
  d->seq_ctr = 0;
  
  MAP_ADCSequenceEnable( ADC_BASE, d->seq_id );
      
  return PLATFORM_OK;
}


int platform_adc_start_sequence()
{ 
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  if( d->running != 1 )
  {
    adc_update_dev_sequence( 0 );

    MAP_ADCSequenceEnable( ADC_BASE, d->seq_id );
    d->running = 1;

    if( d->clocked == 1 )
    {
      MAP_TimerControlTrigger(timer_base[d->timer_id], TIMER_A, true);
      MAP_TimerEnable(timer_base[d->timer_id], TIMER_A);
    }
    else
    {
      MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
    }
  }
  
  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC


// ****************************************************************************
// Analog comparator
//
// TODO: Add code for comparators

#ifdef BUILD_COMP

// LM4F120 - 2 comparators
// C0, positive input PC6, negative input, PC7, output PF0
// C1, positive input PC5, negative input, PC4, output PF1

#ifdef FORLM4F

const static u32 comp_in_ports[] =  { GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE };
const static u8 comp_in_pins[] =    { GPIO_PIN_6, GPIO_PIN_7, GPIO_PIN_5, GPIO_PIN_4 };

// FIXME: Need special handling to reprogram Port F0, also note F1 is chanel of LED
const static u32 comp_out_ports[] =  { GPIO_PORTF_BASE, GPIO_PORTF_BASE };
const static u8 comp_out_pins[] =    { GPIO_PIN_0, GPIO_PIN_1 };

const static u32 comp_ctls[] = { 0, 1 };
// all comparators use same base - COMP_BASE

const static u32 comp_ints[] = { INT_COMP0, INT_COMP1 };

// Predefined reference values, in order
const static u32 comp_refs[] = {};	// Voltage bins
const static u32 comp_ref_codes[] = {};	// Codes used by library
#define NUM_COMP_REFS	(sizeof(comp_refs)/sizeof(u32))

#endif // FORLM4F


// TODO: What can you do with a comparator 
// Generate an output
// Generate an interrupt
// Trigger ADC

// Compare to pin or to internal reference

static void comps_init()
{
}

// Translate whatever voltage reference scheme eLua uses to platform specific
// FIXME: for now vref is reference voltage * 1000 (maybe should make it * 1024)
static unsigned long comp_ref_encode(unsigned vref)
{
// Assuming that bins are of fairly uniform width - use an index search
/* FIXME: Pseudocode
n bins between VMIN and VMAX
	if vref < VMIN -> 0
	if vref > VMAX -> NUM_COMP_REFS-1
	i = ((vref - VMIN) * NUM_COMP_REFS )/(VMAX-VMIN);	// Want integer division
	ASSERT (comp_refs[i] <= vref <= comp_refs[i+1]);
	return i;			// Actually, return whichever is nearer to vref
*/
}

// Translate back from platform voltage ref to eLua 
static unsigned comp_ref_decode(unsigned long refcode)
{
	return comp_refs[i];
};

static unsigned comp_ref_index;

// This platform only allows one vref
unsigned platform_comp_ref_set(unsigned vref)
{
	unsigned long refindex;

	comp_ref_index = comp_vref_encode( vref);
	ComparatorRefSet(COMP_BASE, comp_ref_codes[comp_ref_index]);
	return comp_vref_decode(comp_ref_index);

};

unsigned platform_comp_ref_get(unsigned id)
{
	return comp_vref_decode(comp_ref_index);
};

unsigned long platform_comp_value_get(unsigned id)
{
	return MAP_ComparatorValueGet(COMP_BASE, id);
}; // Actually returns boolean





#endif // ifdef BUILD_COMP


// ****************************************************************************
// Support for specific onboard devices on 
// Texas Instruments / Luminary Micro kits.
//
// FIXME: This was previously tied to the "disp" module but should be renamed in the future
//        to include support for initialization of other onboard devices of the EK-LM3Sxxxx kits.
//        Note that not all kits have all devices available.
#ifdef ENABLE_DISP

void lm3s_disp_init( unsigned long freq )
{
  RIT128x96x4Init( freq );
}

void lm3s_disp_clear()
{
  RIT128x96x4Clear();
}

void lm3s_disp_stringDraw( const char *str, unsigned long x, unsigned long y, unsigned char level )
{
  RIT128x96x4StringDraw( str, x, y, level );
}

void lm3s_disp_imageDraw( const unsigned char *img, unsigned long x, unsigned long y,
                              unsigned long width, unsigned long height )
{
  RIT128x96x4ImageDraw( img, x, y, width, height );
}


